In [ ]:
#Domácí úkol
    # Spočítejte, kolik pasažérů má jenom jedno křestní jméno. (Nápověda: použijte funkci str.len())
    # Zjistěte, ve kterém záchranném člunu bylo nejvíce lidí. (Nápověda: použijte funkci groupby() a argmax())
    # Nezapomeňte poslat odkaz na data, které použijete na projekt! (Pokud jste to ještě neudělali)
    # Odkaz na úkol zašlete nejpozději do 12.12.2017 11:00 CET

In [1]:
import pandas

In [3]:
titanic = pandas.read_excel('http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic3.xls')
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [43]:
titanic['first_name'] = titanic['name'].str.split(', ').str.get(1).str.split('.').str.get(1)
titanic['first_name'].head()

0                      Elisabeth Walton
1                         Hudson Trevor
2                         Helen Loraine
3               Hudson Joshua Creighton
4     Hudson J C (Bessie Waldo Daniels)
Name: first_name, dtype: object

In [61]:
titanic['first_name'].str.split(' ').tail()

1304         [, Hileni]
1305        [, Thamine]
1306    [, Mapriededer]
1307          [, Ortin]
1308            [, Leo]
Name: first_name, dtype: object

In [62]:
titanic_data = titanic['first_name'].str.split(' ').str.len()==2
titanic_data.tail()

1304    True
1305    True
1306    True
1307    True
1308    True
Name: first_name, dtype: bool

In [64]:
sum(titanic_data)

464

In [78]:
a = titanic.groupby('boat').survived.sum()
a

boat
2           1
1           5
10         29
11         25
12         18
13         39
13 15       2
13 15 B     1
14         32
15         37
15 16       1
16         23
2          12
3          26
4          31
5          27
5 7         2
5 9         1
6          20
7          23
8          23
8 10        1
9          25
A           7
B           8
C          37
C D         2
D          19
Name: survived, dtype: int64

In [73]:
import numpy

In [80]:
numpy.argmax(a)

'13'